//
// ──────────────────────────────────────────────────────────────────────────────────────── I ──────────
//   :::::: L O S   N U M E R O S   D E L   1   A L   2 5 0 : :  :   :    :     :        :          :
// ──────────────────────────────────────────────────────────────────────────────────────────────────
//




/* var i = 1;

while (i <= 250) {
    console.log(i);

    i++
} */


//
// ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── I ──────────
//   :::::: L O S   N U M E R O S   M U L T I P L O S   D E   3   M A Y O R E S   Q U E   1 0   Y   M E N O R E S   Q U E   1 0 0 0 : :  :   :    :     :        :          :
// ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
//




/* for (var i = 1; i < 1000; i++) {
    if (i % 3 === 0 && i > 10 && i < 1000) {
        console.log(i)
    }
} */


//
// ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── I ──────────
//   :::::: I M P R I M I R   T O D O S   L O S   D I A S   D E   L A   S E M A N A   A   P A R T I R   D E   U N   A R R A Y : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
//


/* var daysOfTheWeek = [
    'Lunes',
    'Martes',
    'Miércoles',
    'Miercoles',
    'Jueves',
    'Viernes',
    'Sábado',
    'Sabado',
    'Domingo'
];

for (var i = 0; i < daysOfTheWeek.length; i++) {
    var dia = daysOfTheWeek[i];
    console.log(dia);

} */


//
// ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── I ──────────
//   :::::: A   P A R T I R   D E L   M I S M O   A R R A Y   D E   D I A S   I M P R I M I R   S O L O   L O S   D I A S   D E   S E M A N A : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
//

/* var daysOfTheWeek = [
    'Lunes',
    'Martes',
    'Miércoles',
    'Jueves',
    'Viernes',
    'Sábado',
    'Domingo'
];


for (var i = 0; i < daysOfTheWeek.length; i++) {
    var dia = daysOfTheWeek[i];
    switch (dia) {
        case "Domingo":
          
            break;

        case "Sábado":
           
            break;

        default:
            console.log(dia + " es semana");

    }
}
 */

//
// ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── I ──────────
//   :::::: L E T R A   P O R   L E T R A   L A   F R A S E   A N I T A   L A V A   L A   T I N A : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
//

/* var frase = "anita lava la tina";



for (var i = 0; i < frase.length; i++) {

    console.log(frase[i]);

} */


//
// ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── I ──────────
//   :::::: L A   M I S M A   F R A S E   P E R O   D E   A T R A S   H A C I A   A D E L A N T E : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
//

/* var frase = "anita lava la tina";



for (var i = frase.length; i > 0; i--) {

    console.log(frase[i]);

} */


//
// ──────────────────────────────────────────────────────────── I ──────────
//   :::::: P A L I N D R O M O : :  :   :    :     :        :          :
// ──────────────────────────────────────────────────────────────────────
//


/* var palabra = prompt("palabra");

for (var e = 0; e < palabra.length; e++) {

    var primera_bien = palabra[e];
    break;

}

for (var i = palabra.length - 1; i > -1; i--) {

    var primera_reves = palabra[i];
    break;
}


if (primera_bien === primera_reves) {
    alert("la palabra es palindromo");
    console.log(primera_bien);
    console.log(primera_reves);
} else {
    alert("la palabra NO es palindromo");
    console.log(primera_bien);
    console.log(primera_reves);
} */

//
// ────────────────────────────────────────────────────────────────────────────── I ──────────
//   :::::: I M P R I M I R   A S T E R I S C O S : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────────────────────────
//

var escalones = "*****";
var lista = [];

for (var e = 0; e < escalones.length; e++) {

    lista.push(escalones[e]);
    console.log(lista);
    if (e === escalones.length - 1) {
        alert(lista);
    }
}